# 4.5 Data Consistency Checks

# 01 importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02 importing data

In [2]:
#reminding phyton the parent folder path
path = r'C:\Users\juank\Documents\04.2024 Instacar Basket Analysis'

In [3]:
path

'C:\\Users\\juank\\Documents\\04.2024 Instacar Basket Analysis'

In [4]:
# Importing dataset products.csv
df_prod = pd.read_csv(os.path.join(path, '02. Data', 'Original Data', 'products.csv'), index_col = False)

In [5]:
# Importing dataset orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, '02. Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [6]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# 03 Mixed type-data

In [7]:
# create a dataframe
df_test = pd.DataFrame()

In [8]:
# create a mixed typed column 
df_test['mix'] = ['a','b', 1, True]

In [9]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [11]:
# check for mixed types 
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [15]:
# Fix mixed-type column
df_test['mix'] = df_test['mix'].astype('str')

# 04 Missing values

In [12]:
# finding misssing values 
df_prod.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [13]:
#creating a subset df_nan containing only missing values
df_nan = df_prod[df_prod['product_name'].isnull()== True]

In [14]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

# Addressing missing values

In [ ]:
#imputing 
df.describe() # to find the mean
df['column with missings'].fillna(mean value, inplace=True) #code to replace your missing values with the mean

In [ ]:
df_prod.median() # to find the median
df['column with missings'].fillna(median value, inplace=True) #code to replace your missing values with the median

In [16]:
df_prod.shape

(49693, 5)

In [18]:
#creating a dataframe containing only non-missing values
df_prod_clean = df_prod[df_prod['product_name'].isnull() == False] #condition False,i want non-missing values in the new dataframe as opposed to missing values

In [19]:
df_prod_clean.shape

(49677, 5)

In [20]:
df_prod.dropna(inplace = True) #Another way to drop all missing values

In [ ]:
#If i want to use this command to drop only the NaNs from a particular column, the code would look like this:
df_prod.dropna(subset = [‘product_name’], inplace = True)
# If i don’t specify an inplace argument in your code, the function will take the default setting, which is inplace = False
#When specified as False, the command will only return a view of the changed dataframe, leaving the original dataframe untouched.

# 05 Duplicates

In [21]:
# The following command will look for full duplicates within the dataframe:
df_dups = df_prod_clean[df_prod_clean.duplicated()] #df_dups—containing only rows that are duplicates

In [22]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

# Addressing duplicates

In [23]:
df_prod_clean.shape

(49677, 5)

In [ ]:
# creating a new dataframe that doesn’t include the duplicates

In [24]:
df_prod_clean_no_dups = df_prod_clean.drop_duplicates()

In [25]:
df_prod_clean_no_dups.shape

(49672, 5)

# TASK 4.5

In [26]:
#02. Run the df.describe() function on your df_ords dataframe. 
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# the days_since_prior_order column has 206,209 less records compared to the other columns. This column ranges from 0 to 30 days, indicating that some users order frequently, while others may wait longer between orders.
# The number of orders per user varies from 1 to 100. This indicates that some users are more active than others.
# The distribution of orders over the days of the week between 0 and 6 and the hours of the day between 0 and 23 can be observed, which could be useful to understand the buying patterns of the users.

In [27]:
# 03. Check for mixed-type data in your df_ords dataframe.
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [ ]:
#04. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.
according to the search code it seems there are no mixed columns

In [28]:
#05. Run a check for missing values in your df_ords dataframe.
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

# As mentioned above there are 206,209 missing data in column days_since_prior_order. In this regard, I initially thought that it could be due to the later implementation of this variable as a measure of the operations, however, based on this idea I realized that by logic the first order of a user could not have this data since it is not possible to calculate it.

In [29]:
#06 Address the missing values using an appropriate method.
## first, I check if my theory is correct and create a subset with only the missing values and then I count the number of order_number with value 1 
df_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [30]:
df_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [31]:
count_first_orders = df_nan['order_number'].value_counts()

In [32]:
count_first_orders

order_number
1    206209
Name: count, dtype: int64

In [36]:
# count of order_number with value 1 matches missing values
## Create a new variable that acts like a flag based on the missing value.
df_ords['missing_data_alert'] = df_ords['order_number'].apply(lambda x: 'first order' if x == 1 else None)

In [37]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,missing_data_alert
0,0,2539329,1,1,2,8,NaN,first order
1,1,2398795,1,2,3,7,15.0,None
2,2,473747,1,3,3,12,21.0,None
3,3,2254736,1,4,4,7,29.0,None
4,4,431534,1,5,4,15,28.0,None

In [41]:
# 07 Run a check for duplicate values in your df_ords data
df_ords_dups = df_ords[df_ords.duplicated()]

In [42]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, missing_data_alert]
Index: []

# no columns with duplicate values found

In [ ]:
# 08 Address the duplicates using an appropriate method

# columns with duplicate values are not found, but in such a case they are removed with df_ords.drop_duplicates().

In [ ]:
#09 Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [43]:
df_prod_clean_no_dups.to_csv(os.path.join(path, '02. Data','Prepared Data', 'products_checked.csv'))

In [44]:
df_ords.to_csv(os.path.join(path, '02. Data', 'Prepared Data', 'orders_checked.csv'))